app/controllers/comments_controller.rb

SELECT  "links".* FROM "links" WHERE "links"."id" = ? LIMIT 1  [["id", 4]]
INSERT INTO "comments" ("body", "link_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "hat saale"], ["link_id", 4], ["user_id", 3], ["created_at", "2018-01-18 12:21:27.981398"], ["updated_at", "2018-01-18 12:21:27.981398"]]
---
  def create
    @link = Link.find(params[:link_id])
    @comment = @link.comments.new(comment_params)
    @comment.user = current_user

    respond_to do |format|
      if @comment.save