app/controllers/links_controller.rb

INSERT INTO "links" ("title", "url", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "kkk"], ["url", "kkk"], ["user_id", 3], ["created_at", "2018-01-18 10:00:25.350314"], ["updated_at", "2018-01-18 10:00:25.350314"]]
---
  def create
    #@link = Link.new(link_params)
    @link = current_user.links.build(link_params)

    respond_to do |format|
      if @link.save

UPDATE "links" SET "title" = ?, "updated_at" = ? WHERE "links"."id" = ?  [["title", "hatt saale"], ["updated_at", "2018-01-19 06:36:06.122208"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @link.update(link_params)